// Создать новый файл lesson2.html
// Создать переменную и спросить у пользователя “Ваш возраст”
// Вывести на экран текст. Вам “возраст пользователя” лет
// Спросить у пользователя его имя
// Вывести на экран, Добро пожаловать на сайт “Имя пользователя”
// * Если пользователь ввёл отрицательное число, написать текст “ввели неверное значение”
// Если пользователь ввёл 1, необходимо вывести текст Вам “возраст пользователя” год
// Если возраст пользователя от 2 до 4 лет, то Вам “возраст пользователя” года

// let userAge = +prompt("Ваш возраст?");
// if (userAge < 0) {
//     alert('Вы ввели неверное значение!');
//     } else if (userAge == 1) {
//         alert(`Вам ${userAge} год!`)
//         }else if(userAge>=2 && userAge <= 4){
//             alert(`Вам ${userAge} года`);
//         }
// alert(`Вам ${userAge} лет`);
// let userName = prompt("Ваше имя?");
// alert(`Добро пожаловать на сайт ${userName}`);

// let a = 13;
// let b = 5;
// let div = a % b;
// console.log(div);

// let a;

// Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется в консоли. Определите, в какой строке кода случилась ошибка.
// Необходимо вывести в консоль результат суммы данных переменных
// let a = '2';
// let b = '3';
// Пользователь с клавиатуры вводит 2 числа, необходимо в консоль вывести текст
// Сумма чисел равна “результат”
// Разность чисел равна “результат”
// Произведение чисел равно “результат”
// Частное чисел равно “результат”
// Остаток от деления чисел равен “результат”

// let a = 3;
// let a = 4;
// console.log(a);
// let a = '2';
// let b = '3';
// console.log(a + b);
// let a = +prompt("Введите первое число");
// let b = +prompt("Введите второе число");

// console.log(`Сумма чисел равна ${a + b}
// \nРазность чисел равна ${a - b}
// \nПроизведение чисел равно ${a * b}
// \nЧастное чисел равно ${a / b}
// \nОстаток от деления чисел равен ${a % b}`);

// console.log(String(true));
// console.log(typeof String(true));
// console.log(true - true);

// Пользователь с клавиатуры вводит число, Необходимо создать условный оператор который
// Выводит в консоль “Число больше 5”
// Выводит в консоль “Число меньше 5”
// Выводит в консоль “Число равно 5”
// Даны переменные test1 и test2(вводятся с клавиатуры). Проверьте, равны ли их значения и выведите соответствующее сообщение.
// Пользовать с клавиатуры вводит 2 числа
// Необходимо найти какое из двух чисел минимальное
// Пользователь с клавиатуры вводит число, Проверьте, что данная переменная больше 0 и меньше 15.

// let userNum = +prompt('Введите число');
// if (userNum > 5) {
//     console.log('Число больше 5')
// } else if (userNum < 5) {
//     console.log('Число меньше 5')
// } else {
//     console.log('Число равно 5')
// }

// let test1 = prompt("Введите первое значение");
// let test2 = prompt("Введите второе значение");
// if (test1 === test2) {
//   console.log("Значения равны");
// } else {
//     console.log('Значения не равны');
// }

// let userNum1 = +prompt('Введите первое число');
// let userNum2 = +prompt('Введите второе число');
// let minNum;
// if (userNum1 < userNum2) {
//     minNum = userNum1;
// } else {
//     minNum = userNum2;
// }
// console.log(minNum);

// let userNum = +prompt('Введите число');
// if (userNum > 0 && userNum < 15) {
//     console.log('Введенная переменная больше 0 и меньше 15')
// } else if (userNum <= 0) {
//     console.log('Переменная меньше либо равно 0')
// } else if (userNum >= 15) {
//     console.log('Переменная больше либо равна 15')
// }

